## "Пирамида"

### Задание

Из остатков кирпичей Сергей сложил пирамиду. \
На вершине пирамиды лежит один кирпич, на втором сверху ряду два кирпича,
на третьем - три, и т.д., в нижнем ряду пирамиды количество кирпичей равно количеству уровней пирамиды.
После этого он написал на каждом кирпиче по числу, равному количеству кирпичей на этом уровне,
т.е. на верхнем уровне 1, на втором уровне 2, и т.д. \
Определите сумму чисел написанных на кирпичах.

### Формат входных данных

Дано одно целое положительное число — количество уровней в пирамиде

### Формат выходных данных

Вывести сумму чисел написанных на кирпичах

### Решение задачи

```python
level_num = int(input("введите число уровней в пирамиде: "))
sum = 0  # Переменная для накопления суммы
count = 1

while  count <= level_num:
    block_num = count*count
    sum = sum +block_num
    count += 1
print("сумма чисел написанных на кирпичах ", sum)
```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | :---: |
|    2    | 5 |
|    3    | 14 |
|    5    | 55  |
|    7    | 140 |

### Подсказки

<details>
<summary>Подсказка-1</summary>
Возьмите ручку и листок бумаги, нарисуйте условия задачи. Из рисунка вам станет понятно, как посчитать сумму чисел на каждом этаже.
</details>

<details>
<summary>Подсказка-2</summary>
Если вы поняли, как посчитать сумму, зная номер этажа. То остается просто пройти по всем этажам и найти общую сумму на всех.

Смотри пример "Нахождение суммы чисел в диапазоне [a, b]"
</details>
